In [17]:
from sklearn import datasets
import numpy as np

In [18]:
bs = datasets.load_boston()

In [19]:
bs

{'data': array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
         4.9800e+00],
        [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
         9.1400e+00],
        [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
         4.0300e+00],
        ...,
        [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         5.6400e+00],
        [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
         6.4800e+00],
        [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         7.8800e+00]]),
 'target': array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
        18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
        15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
        13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
        21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
        35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
        19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
        20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
        23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
        33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
        21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
        20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
        23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
        15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
        17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
        25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
        23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
        32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
        34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
        20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
        26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
        31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
        22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
        42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
        36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
        32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
        20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
        20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
        22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
        21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
        19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
        32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
        18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
        16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
        13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
         7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
        12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
        27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
         8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
         9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
        10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
        15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
        19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
        29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
        20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
        23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9]),
 'feature_names': array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
        'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7'),
 'DESCR': "Boston House Prices dataset\n===========================\n\nNotes\n------\nData Set Characteristics:  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive\n    \n    :Median Value (attribute 14) is usually the target\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttp://archive.ics.uci.edu/ml/datasets/Housing\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n**References**\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n   - many more! (see http://archive.ics.uci.edu/ml/datasets/Housing)\n"}

In [20]:
X = bs.data
X.shape

(506, 13)

In [21]:
X[:4]

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, 0.0000e+00, 5.3800e-01,
        6.5750e+00, 6.5200e+01, 4.0900e+00, 1.0000e+00, 2.9600e+02,
        1.5300e+01, 3.9690e+02, 4.9800e+00],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00, 4.6900e-01,
        6.4210e+00, 7.8900e+01, 4.9671e+00, 2.0000e+00, 2.4200e+02,
        1.7800e+01, 3.9690e+02, 9.1400e+00],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00, 4.6900e-01,
        7.1850e+00, 6.1100e+01, 4.9671e+00, 2.0000e+00, 2.4200e+02,
        1.7800e+01, 3.9283e+02, 4.0300e+00],
       [3.2370e-02, 0.0000e+00, 2.1800e+00, 0.0000e+00, 4.5800e-01,
        6.9980e+00, 4.5800e+01, 6.0622e+00, 3.0000e+00, 2.2200e+02,
        1.8700e+01, 3.9463e+02, 2.9400e+00]])

In [22]:
y = bs.target
y.shape
y[:1]

array([24.])

In [23]:
bos = np.c_[y,X] #automatically the concatenation

In [24]:
bos[:3]

array([[2.4000e+01, 6.3200e-03, 1.8000e+01, 2.3100e+00, 0.0000e+00,
        5.3800e-01, 6.5750e+00, 6.5200e+01, 4.0900e+00, 1.0000e+00,
        2.9600e+02, 1.5300e+01, 3.9690e+02, 4.9800e+00],
       [2.1600e+01, 2.7310e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00,
        4.6900e-01, 6.4210e+00, 7.8900e+01, 4.9671e+00, 2.0000e+00,
        2.4200e+02, 1.7800e+01, 3.9690e+02, 9.1400e+00],
       [3.4700e+01, 2.7290e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00,
        4.6900e-01, 7.1850e+00, 6.1100e+01, 4.9671e+00, 2.0000e+00,
        2.4200e+02, 1.7800e+01, 3.9283e+02, 4.0300e+00]])

In [25]:
X.shape, y.shape, X.ndim, y.ndim

((506, 13), (506,), 2, 1)

In [26]:
y = y.reshape(-1, 1)
y.shape

(506, 1)

In [27]:
bos = np.concatenate((y,X),axis = 1)

In [28]:
bos.shape

(506, 14)

In [29]:
bos[0,0]

24.0

In [30]:
import pandas as pd

In [31]:
list(bs.feature_names)

['CRIM',
 'ZN',
 'INDUS',
 'CHAS',
 'NOX',
 'RM',
 'AGE',
 'DIS',
 'RAD',
 'TAX',
 'PTRATIO',
 'B',
 'LSTAT']

In [32]:
bosdf = pd.DataFrame(bos, columns = ['medv'] + list(bs.feature_names))
bosdf[:3]

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03

# PANDAS DATAFRAME

In [33]:
#Heterogenous data-structure - unlike numpy arrays
#but each column will be homogenous
#so it's built over numpy and scipy and hence we can apply functions on pandas dataframe

### Create a df

In [1]:
import pandas as pd
#from a dictionary #values in the list format
dict1 = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597,1.221],
"population":[200.4, 143.5, 1252, 1357,52.98] }

In [2]:
pd.DataFrame(dict1)

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [3]:
brics = pd.DataFrame(dict1, index = ['A', 'B', 'C', 'D', 'E'])
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [36]:
#you can control the number of columns being imported from the dictionary using the columns tab
df = pd.DataFrame(dict1, index = ['A','B','C', 'D', 'E'], columns = ['country', 'capital', 'area'])
df

        country    capital    area
A        Brazil   Brasilia   8.516
B        Russia     Moscow  17.100
C         India  New Delhi   3.286
D         China    Beijing   9.597
E  South Africa   Pretoria   1.221

In [7]:
dict1

{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
 'capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
 'area': [8.516, 17.1, 3.286, 9.597, 1.221],
 'population': [200.4, 143.5, 1252, 1357, 52.98]}

In [6]:
#case of the column names is important
df = pd.DataFrame(dict1, index = ['A','B','C', 'D', 'E'], columns = ['Country', 'capital', 'area'])
df

  Country    capital    area
A     NaN   Brasilia   8.516
B     NaN     Moscow  17.100
C     NaN  New Delhi   3.286
D     NaN    Beijing   9.597
E     NaN   Pretoria   1.221

In [9]:
#Each column / row a in df is a pandas series - it's a heterogenous unidimensionalds
dict_2 = {'country': "South Africa", 
          "Capital": "Pretoria", 
         "area": 1.22, 
          "population": 52.98}

In [10]:
x = pd.Series(dict_2)
x

country       South Africa
Capital           Pretoria
area                  1.22
population           52.98
dtype: object

In [39]:
type(x), type(df)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [11]:
x.shape, df.shape

((4,), (5, 3))

In [40]:
#creating a df from a list of dictionaries
pd.DataFrame([{"name": "Raj", "Age": 21}, {"name": "Mukul", "Age": 25 },{"name": "Rahul", "Age": 30}])

   Age   name
0   21    Raj
1   25  Mukul
2   30  Rahul

In [17]:
#creating a df using lists of row values
lst_1 = ["Brazil", "Brasilia", 8.516, 200.40]
lst_2 = ["South Africa", "Pretoria", 1.22, 52.98]

In [13]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [14]:
brics.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [20]:
pd.DataFrame(data = [lst_1, lst_2], columns = brics.columns)

        country   capital   area  population
0        Brazil  Brasilia  8.516      200.40
1  South Africa  Pretoria  1.220       52.98

In [26]:
#Create the dataframe using series
ser = pd.Series(data = [200.4, 123,231, 123], index = ["Brazil", "Russia","India", "China"])
ser

Brazil    200.4
Russia    123.0
India     231.0
China     123.0
dtype: float64

In [25]:
s = pd.Series(data = [200.4, 123,231, 123])

In [23]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [45]:
ser["Russia"]

123.0

In [28]:
pd.DataFrame(ser, columns = ["Population"])

        Population
Brazil       200.4
Russia       123.0
India        231.0
China        123.0

----

In [47]:
#Row Indices and the column names

In [48]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [49]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [43]:
brics.columns = ['co', 'cap', 'ar', 'pop']
brics

             co        cap      ar      pop
A        Brazil   Brasilia   8.516   200.40
B        Russia     Moscow  17.100   143.50
C         India  New Delhi   3.286  1252.00
D         China    Beijing   9.597  1357.00
E  South Africa   Pretoria   1.221    52.98

In [30]:
brics.columns[1]

'capital'

In [35]:
x = list(brics.columns)
x

['co', 'cap', 'ar', 'pop']

In [36]:
x[2] = "area"
x[0] = "country"
x

['country', 'cap', 'area', 'pop']

In [44]:
brics.columns = x
brics

        country        cap    area      pop
A        Brazil   Brasilia   8.516   200.40
B        Russia     Moscow  17.100   143.50
C         India  New Delhi   3.286  1252.00
D         China    Beijing   9.597  1357.00
E  South Africa   Pretoria   1.221    52.98

In [46]:
#rename function
brics.rename(columns = {'cap': "capital", "pop": "population"}, inplace = True)

In [47]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [67]:
#same way we can change the row index of selected rows
brics.rename(index = {'South Africa': "SA"}, inplace = True)

In [68]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [42]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [53]:
brics  = brics.rename(mapper = str.lower, axis = 'rows')

In [51]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
a        Brazil   Brasilia   8.516      200.40
b        Russia     Moscow  17.100      143.50
c         India  New Delhi   3.286     1252.00
d         China    Beijing   9.597     1357.00
e  South Africa   Pretoria   1.221       52.98

In [65]:
brics.rename(mapper = str.lower, inplace = True) #default axis is rows

In [66]:
brics

                capital    area  population
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [62]:
brics.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [63]:
brics.set_index('COUNTRY', inplace = True)
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [64]:
brics.index

Index(['Brazil', 'Russia', 'India', 'China', 'South Africa'], dtype='object', name='COUNTRY')

In [67]:
brics.reset_index(inplace = True)

In [68]:
brics

        COUNTRY    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [70]:
brics.reset_index()

   index       COUNTRY    capital    area  population
0      0        Brazil   Brasilia   8.516      200.40
1      1        Russia     Moscow  17.100      143.50
2      2         India  New Delhi   3.286     1252.00
3      3         China    Beijing   9.597     1357.00
4      4  South Africa   Pretoria   1.221       52.98

In [66]:
#brics.set_index('COUNTRY', inplace=True)

In [69]:
brics.reset_index(inplace = True)

In [70]:
brics

   index       COUNTRY    CAPITAL    AREA  POPULATION
0      0        Brazil   Brasilia   8.516      200.40
1      1        Russia     Moscow  17.100      143.50
2      2         India  New Delhi   3.286     1252.00
3      3         China    Beijing   9.597     1357.00
4      4  South Africa   Pretoria   1.221       52.98

-----

In [ ]:
movies = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv', na_values = ['?', "NA", 1])
movies.head(3)

In [72]:
movies = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv', index_col = 0, na_values = {'genres':['?', "NA", "1"], "title": ["Jumanji (1995)"]})
movies.head(3)

                           title                                       genres
movieId
1               Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
2                            NaN                   Adventure|Children|Fantasy
3        Grumpier Old Men (1995)                               Comedy|Romance

In [73]:
import pandas as pd
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= "Sheet1")

In [77]:
hy.head(3)

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE

In [79]:
import pandas as pd
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= ["Sheet1","ABC"])
hy

OrderedDict([('Sheet1',
                           Date Bill Number                        Item Desc      Time  \
              0      2010-04-01     G0470115  QUA  MINERAL WATER(1000ML)      13:15:11
              1      2010-04-01     G0470115  MONSOON MALABAR (AULAIT)        13:15:11
              2      2010-04-01     G0470116  MASALA CHAI CUTTING             13:17:35
              3      2010-04-01     G0470117  QUA  MINERAL WATER(1000ML)      13:19:55
              4      2010-04-01     G0470283  MOROCCAN MINT TEA               01:20:18
              5      2010-04-01     G0470283  QUA  MINERAL WATER(1000ML)      01:20:18
              6      2010-04-01     G0470118  MASALA CHAI CUTTING             13:21:34
              7      2010-04-01     G0470118  MOROCCAN MINT TEA               13:21:34
              8      2010-04-01     G0470284  CAPPUCCINO                      01:29:38
              9      2010-04-01     G0470285  MOROCCAN MINT TEA               01:29:46
              10     2010-04-01     G0470285  SUMATRA MANDHELING (REG)        01:29:46
              11     2010-04-01     G0470285  BRAZIL BOURBONSANTOS (AULAIT)   01:29:46
              12     2010-04-01     G0470120  LEMON ICED TEA                  13:36:33
              13     2010-04-01     G0470122  COUNTRY LEMONADE                13:42:05
              14     2010-04-01     G0470122  LEMON ICED TEA                  13:42:05
              15     2010-04-01     G0470127  CAPPUCCINO                      14:02:15
              16     2010-04-01     G0470128  QUA  MINERAL WATER(1000ML)      14:02:35
              17     2010-04-01     G0470133  CAPPUCCINO                      14:21:32
              18     2010-04-01     G0470139  QUA  MINERAL WATER(1000ML)      14:53:24
              19     2010-04-01     G0470140  MIAMI MELONS                    14:54:32
              20     2010-04-01     G0470141  CAFFE LATTE                     15:08:58
              21     2010-04-01     G0470141  CAPPUCCINO                      15:08:58
              22     2010-04-01     G0470142  COUNTRY LEMONADE                15:09:07
              23     2010-04-01     G0470145  COUNTRY LEMONADE                15:39:18
              24     2010-04-01     G0470146  RED BULL ENERGY DRINK           15:48:25
              25     2010-04-01     G0470148  BRAZIL BOURBONSANTOS (REG)      16:06:01
              26     2010-04-01     G0470149  DOPPIO                          16:07:55
              27     2010-04-01     G0470153  CAFFE LATTE                     16:15:45
              28     2010-04-01     G0470154  PINK LEMONADE                   16:15:50
              29     2010-04-01     G0470156  CAPPUCCINO                      16:16:40
              ...           ...          ...                             ...       ...
              145800 2011-02-25     N0033492  WHITE SANGRIA (GLS)áááá áááááá  00:57:01
              145801 2010-04-25     N0028289  WHITE SANGRIA (GLS)áááá áááááá  13:53:17
              145802 2010-05-26     N0028780  WHITE SANGRIA (GLS)áááá áááááá  21:58:31
              145803 2010-11-26     N0031644  WHITE SANGRIA (GLS)áááá áááááá  16:06:25
              145804 2010-12-28     N0032407  WHITE SANGRIA (GLS)áááá áááááá  21:50:35
              145805 2011-01-29     N0033015  WHITE SANGRIA (GLS)áááá áááááá  00:05:32
              145806 2010-05-29     N0028849  WHITE SANGRIA (GLS)áááá áááááá  23:11:29
              145807 2010-09-29     N0030759  WHITE SANGRIA (GLS)áááá áááááá  22:43:23
              145808 2010-11-30     N0031733  WHITE SANGRIA (GLS)áááá áááááá  21:34:54
              145809 2010-12-30     N0032455  WHITE SANGRIA (GLS)áááá áááááá  22:10:50
              145810 2010-07-31     N0029786  WHITE SANGRIA (GLS)áááá áááááá  18:38:26
              145811 2010-06-06     N0028955  ZINZI RED (GLS)                 20:55:01
              145812 2010-05-16     N0028643  ZINZI RED (GLS)                 23:12:37
              145813 2010-05-23     N0028741  ZINZI RED (GLS)                 22:44:29
              145814 2010-05-23     N0028742  ZINZI RED (GLS)                 22:59:31
              145815 2010-05-24     N0028754  ZINZI RED (GLS)                 01:08:06
              145816 2010-04-27     N0028347  ZINZI RED (GLS)                 00:19:00
              145817 2010-05-29     N0028860  ZINZI RED (GLS)                 01:20:13
              145818 2010-05-29     N0028850  ZINZI RED (GLS)                 23:12:22
              145819 2010-04-30     N0028399  ZINZI RED (GLS)                 23:44:37
              145820 2010-06-08     N0028991  ZINZI WHITE  (GLS)              01:09:11
              145821 2010-06-08     N0028977  ZINZI WHITE  (GLS)              10:41:38
              145822 2010-06-10     N0029010  ZINZI WHITE  (GLS)              01:00:53
              145823 2010-05-18     N0028656  ZINZI WHITE  (GLS)              16:52:21
              145824 2010-05-19     N0028669  ZINZI WHITE  (GLS)              17:06:10
              145825 2010-05-22     N0028716  ZINZI WHITE  (GLS)              21:43:55
              145826 2010-04-27     N0028343  ZINZI WHITE  (GLS)              20:52:11
              145827 2010-05-28     N0028835  ZINZI WHITE  (GLS)              01:03:37
              145828 2010-04-30     N0028399  ZINZI WHITE  (GLS)              23:44:37
              145829 2010-07-09     N0029472  ZINZI WHITE (BTL)               00:31:51

                      Quantity   Rate     Tax  Discount   Total  Category
              0              1   50.0   11.88       0.0   61.88  BEVERAGE
              1              1  100.0   23.75       0.0  123.75  BEVERAGE
              2              1   40.0    9.50       0.0   49.50  BEVERAGE
              3              1   50.0   11.88       0.0   61.88  BEVERAGE
              4              1   45.0   10.69       0.0   55.69  BEVERAGE
              5              1   50.0   11.88       0.0   61.88  BEVERAGE
              6              1   40.0    9.50       0.0   49.50  BEVERAGE
              7              1   45.0   10.69       0.0   55.69  BEVERAGE
              8              1   60.0   14.25       0.0   74.25  BEVERAGE
              9              1   45.0   10.69       0.0   55.69  BEVERAGE
              10             1   95.0   22.56       0.0  117.56  BEVERAGE
              11             1  115.0   27.31       0.0  142.31  BEVERAGE
              12             1   85.0   20.19       0.0  105.19  BEVERAGE
              13             1   85.0   20.19       0.0  105.19  BEVERAGE
              14             2   85.0   40.38       0.0  210.38  BEVERAGE
              15             1   60.0   14.25       0.0   74.25  BEVERAGE
              16             1   50.0   11.88       0.0   61.88  BEVERAGE
              17             2   60.0   28.50       0.0  148.50  BEVERAGE
              18             1   50.0   11.88       0.0   61.88  BEVERAGE
              19             1   85.0   20.19       0.0  105.19  BEVERAGE
              20             1   70.0   16.63       0.0   86.63  BEVERAGE
              21             2   60.0   28.50       0.0  148.50  BEVERAGE
              22             1   85.0   20.19       0.0  105.19  BEVERAGE
              23             1   85.0   20.19       0.0  105.19  BEVERAGE
              24             1  125.0   29.69       0.0  154.69  BEVERAGE
              25             1   95.0   22.56       0.0  117.56  BEVERAGE
              26             1   60.0   14.25       0.0   74.25  BEVERAGE
              27             1   70.0   16.63       0.0   86.63  BEVERAGE
              28             1   85.0   20.19       0.0  105.19  BEVERAGE
              29             1   60.0   14.25       0.0   74.25  BEVERAGE
              ...          ...    ...     ...       ...     ...       ...
              145800         1  175.0   45.50       0.0  220.50    LIQUOR
              145801         1  175.0   45.50       0.0  220.50    LIQUOR
              145802         1  175.0   45.50       0.0  220.50    LIQUOR
              145803         1  175.0   45.50       0.0  220.50    LIQUOR
              145804         1  175.0   45.50       0.0  220.50    LIQUOR
              145805         1  175.0   45.50       0.0  220.50    LIQUOR
              145806         1  175.0   45.50       0.0  220.50    LIQUOR
              145807         2  175.0   91.00       0.0  441.00    LIQUOR
              145808         2  175.0   91.00       0.0  441.00    LIQUOR
              145809         1  175.0   45.50       0.0  220.50    LIQUOR
              145810         1  175.0   45.50       0.0  220.50    LIQUOR
              145811         1  150.0   39.00       0.0  189.00    LIQUOR
              145812         1  150.0   39.00       0.0  189.00    LIQUOR
              145813         1  150.0   39.00       0.0  189.00    LIQUOR
              145814         1  150.0   39.00       0.0  189.00    LIQUOR
              145815         1  150.0   39.00       0.0  189.00    LIQUOR
              145816         1  150.0   39.00       0.0  189.00    LIQUOR
              145817         1  150.0   39.00       0.0  189.00    LIQUOR
              145818         1  150.0   39.00       0.0  189.00    LIQUOR
              145819         1  150.0   39.00       0.0  189.00    LIQUOR
              145820         2  150.0   78.00       0.0  378.00    LIQUOR
              145821         1  150.0   39.00       0.0  189.00    LIQUOR
              145822         2  150.0   78.00       0.0  378.00    LIQUOR
              145823         1  150.0   39.00       0.0  189.00    LIQUOR
              145824         1  150.0   39.00       0.0  189.00    LIQUOR
              145825         2  150.0   78.00       0.0  378.00    LIQUOR
              145826         2  150.0   78.00       0.0  378.00    LIQUOR
              145827         3  150.0  117.00       0.0  567.00    LIQUOR
              145828         1  150.0   39.00       0.0  189.00    LIQUOR
              145829         1  700.0  182.00       0.0  882.00    LIQUOR

              [145830 rows x 10 columns]),
             ('ABC',    Unnamed: 0 Unnamed: 1
              0         NaN        NaN
              1         NaN          s
              2         3.0          4)])

In [81]:
hy['Sheet1'].head(3)

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE

In [82]:
hy['ABC']

   Unnamed: 0 Unnamed: 1
0         NaN        NaN
1         NaN          s
2         3.0          4

In [73]:
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= "Sheet1")

In [74]:
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= [0,1])

In [75]:
hy[1]

   Unnamed: 0 Unnamed: 1
0         NaN        NaN
1         NaN          s
2         3.0          4

In [76]:
hy = hy[0]

In [77]:
hy['ABC']

KeyError: 'ABC'

In [ ]:
hy = hy['Sheet1']

In [ ]:
hy.head()

In [ ]:
hy.tail()

In [ ]:
hy.shape

In [ ]:
movies = pd.read_table(r"C:\Users\Vaibhav\Desktop\BA\simplilearn\Python\DataSciencePy\Projects for Submission\Project4_Movielens\movies.dat", sep ='::', header = None, names = ["MovieID","Title", "Genres"])

In [ ]:
movies.head()

In [ ]:
#movies

In [ ]:
movies.info()

In [ ]:
movies.dtypes

In [ ]:
hyp = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 8-9 Hypothesis Testing Ex 1.csv", index_col = 0)

In [ ]:
hyp.head(3)

In [ ]:
hyp.info()

In [ ]:
#To change the dtype of gender to boolean
type(hyp.Gender)

In [ ]:
hyp.Gender = hyp.Gender.astype(np.bool)
hyp.head(3)

In [ ]:
hyp = hyp.astype({'Gender': str, 'Read': np.float64})
hyp.head(3)

In [ ]:
hyp.Math1 = hyp.Math1.astype(np.float64)

In [ ]:
#suppose I want to convert multiple cols into categorical type

In [ ]:
categorical = list(hyp.columns)[0:5]

In [ ]:
for i in categorical:
    hyp[i] = hyp[i].astype('category')
hyp.info()

In [ ]:
np.unique(hyp.Gender)

In [ ]:
pd.value_counts(hyp.Gender)

### Slicing Dataframes

In [ ]:
brics

In [ ]:
#brics.set_index("COUNTRY")
brics

In [ ]:
#access the rows
brics[:4] #all the list slicing ways are applicable here

In [ ]:
#brics[4] #integer indexing does not work

In [ ]:
#to retrieve a few columns
l = brics[['COUNTRY', 'CAPITAL']]
l

In [ ]:
#To retrieve a unidimensional series
brics['COUNTRY']

In [ ]:
#To retrieve a unidimensional series
brics.COUNTRY

In [ ]:
brics

In [ ]:
brics.reset_index(inplace=True)

In [ ]:
np.logical_and(brics.CAPITAL == "New Delhi", brics.COUNTRY =="China")

In [ ]:
np.logical_or(brics.CAPITAL == "New Delhi", brics.AREA<10)

In [ ]:
brics[np.logical_or(brics.CAPITAL == "New Delhi", brics.AREA<10)]

In [ ]:
brics[[True, False, True, False, True]]

In [ ]:
#loc command

In [ ]:
brics.set_index("COUNTRY", inplace=True)

In [ ]:
brics.loc['Brazil', 'CAPITAL']

In [ ]:
brics.loc[['Brazil', 'Russia', 'India'], ['CAPITAL', 'POPULATION']]

In [ ]:
brics.loc['Brazil']

In [ ]:
brics[['CAPITAL']]

In [ ]:
#bosdf - to get the top 100 rows
bosdf[:101]

In [ ]:
brics.loc[:, 'POPULATION']

In [ ]:
brics.loc['Brazil': 'China':2, :]

In [ ]:
brics.loc['China': 'Brazil':-1, 'AREA':]

In [ ]:
brics

In [ ]:
brics.loc[[True, False, True, False, False], [True, False, True]]

In [ ]:
brics.loc[brics.CAPITAL.isin(['Moscow', 'Beijing'])]

In [ ]:
brics.CAPITAL.isin(['Moscow', 'Beijing'])

In [ ]:
brics.loc[:, brics.columns.isin(['CAPITAL', 'AREA'])]

In [ ]:
bosdf.loc[:3,:] #here the row indexes are the integers, and hence we are giving integer values for row indices

In [ ]:
#using iloc and loc commands we can change the positions of the columns

In [ ]:
#iloc - row number and collumn numbers

In [ ]:
brics.iloc[:4,2]

In [ ]:
brics.iloc[[1],:2] #gives the first row (and 2nd col) in df format

In [ ]:
brics.iloc[1,:2] #gives in the series format

In [ ]:
brics.iloc[[1]]

In [ ]:
brics.iloc[[1,3]]

In [ ]:
brics.iloc[-3:-1, 1:3]

In [ ]:
brics.iloc[:, brics.columns.isin(['CAPITAL', 'A', 'AREA'])]

In [ ]:
brics.iloc[[0,1,2],[0,2]]

In [ ]:
bosdf.loc[[0,1,2], ['medv', 'CRIM']]

In [ ]:
#iloc - helps us retrieving based on the row numbers and colunmn number
#loc - helps us retrieve based on row indices and column indices

In [ ]:
#isin function and in function

In [ ]:
brics.columns.isin(['country', 'CAPITAL', 'AREA']) #gives t and false corresponding to each component

In [ ]:
brics.columns

In [ ]:
list(brics.columns) in ['country', 'CAPITAL', 'AREA']

In [ ]:
list(brics.columns)

In [ ]:
'CAPITAL' in ['country', 'CAPITAL', 'AREA']

In [ ]:
hyp.head(3)

In [ ]:
#to retrieve all rows having races 1 and 2

In [ ]:
hyp[hyp.Race.isin([1,2])].head()

----

### Statistical functions using axis
- axis = 0 - row-wise reduction
- axis = 1 - col wise reduction

In [ ]:
hyp.head(3)

In [ ]:
hyp.mean()

In [ ]:
hyp.mean(axis = 0, skipna = True)

In [ ]:
#mean median sum std min max argmin argmax

In [ ]:
hyp.Math1.quantile(.9)

In [ ]:
hyp.Math1.quantile(.99)

In [ ]:
hyp.Math1.var()

In [ ]:
hyp.Math1.skew()

In [ ]:
#bsubsetting
hyp[hyp.Math1>50]

In [ ]:
#which row numbers true is there for condition hyp.math1>50
np.where(hyp.Math1>50)#gives the location of the Trues in my data

---

### Summary Functions

In [ ]:
hyp.info()

In [ ]:
hyp.dtypes

In [ ]:
hyp.describe() #described all the numerical columns

In [ ]:
hyp.describe(include = 'all')

In [ ]:
#25%ile same as 1st quartile
#75%ile same as 3rd quartile

In [ ]:
hyp.Gender.dtype

In [ ]:
hyp.Race.dtype

In [ ]:
#univariate freq distribution of Race categorical var
pd.value_counts(hyp.Race, dropna = True)

In [ ]:
#bi-variate freq dist b/w 2 categorical col
pd.crosstab(index = hyp.Gender, columns=hyp.Race, dropna=False)

In [ ]:
hyp.head(3)

In [ ]:
hyp.reset_index(inplace=True)

In [ ]:
#pivot_table - used 3 variable aggregation
hyp.pivot_table(index = "Gender", columns="Race", values = "ID", aggfunc= lambda x: len(x))

In [ ]:
#Average marks in Read race and gender wise
hyp.pivot_table(index = "Gender", columns="Race", values = "Read", aggfunc= lambda x: np.mean(x))

In [ ]:
#Factor + Factor + aggregations of continuous
hyp.pivot_table(index = "Gender", columns="Race", values = "Math1", aggfunc= lambda x: x.median(skipna= True))

In [ ]:
matches = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\matches.csv")

In [ ]:
matches.head(3)

In [ ]:
matches.toss_decision.unique()

In [ ]:
grouped = matches.groupby("toss_decision")

In [ ]:
type(grouped)

In [ ]:
grouped

In [ ]:
bat_df = grouped.get_group("bat")
bat_df.head(2)

In [ ]:
field_df = grouped.get_group("field")
field_df.head(3)

In [ ]:
#level-wise summary statistic
grouped.win_by_runs.mean() #level-wise mean

In [ ]:
grouped.count() #for the non-null values

In [ ]:
grouped.mean()

In [ ]:
grouped[['season', 'win_by_runs']].mean()

In [ ]:
grouped.describe()

In [ ]:
#to apply 2 fns on each of the col
grouped.agg(['sum', np.mean])

In [ ]:
#Aggregations can also be used to specify different aggregation fn on each column

In [ ]:
def data_range(series):
    return series.max() - series.min()

In [ ]:
aggregations = {
                'season':{'Season_Mean': np.mean},
                'win_by_runs': {'Max_winbyruns': np.max, 'Range_win_by_runs': data_range},
                'win_by_wickets': {'Min_winbywickets': np.min }}

In [ ]:
grouped.agg(aggregations)

In [ ]:
#grouping by 2 categorical column - factor+factor+continuous aggregation
matches.groupby(['toss_decision', 'result']).win_by_runs.sum().unstack()

---

### Concatenation

In [ ]:
brics

In [ ]:
brics.reset_index(inplace = True)

In [ ]:
brics.drop(['level_0', 'index'], axis = 1, inplace=True)
brics

In [ ]:
dict2 = {
"country":["Brazil", "Russia"],
"capital":["Brasilia", "Moscow",],
"area":[8.516, 17.10],
"population":[200.4, 143.5] }

In [ ]:
dummy = pd.DataFrame(dict2)
dummy

In [ ]:
brics.append(dummy) #new columns created because the column names are not same

In [ ]:
dummy = dummy.rename(mapper = str.upper, axis = 1)

In [ ]:
brics = brics.append(dummy)
brics

In [ ]:
brics.reset_index(inplace = True)

In [ ]:
brics.drop("index", axis = 1, inplace=True)

In [ ]:
#column-wise concatenation
x = pd.concat([brics, dummy], axis = 1)

In [ ]:
#to insert a column at pos3
brics.insert(loc = 3, column = "x", value = [1,2,3,4,5,6,7])

In [ ]:
brics

----

In [ ]:
left = { 'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']}

right = {'id':[1,6,3,4,5],
         'Height': [120,110,115,119,130],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']}

In [ ]:
left = pd.DataFrame(left)
left

In [ ]:
right = pd.DataFrame(right)
right

In [ ]:
a = pd.merge(left, right, how = "inner", on ="id")
a

In [ ]:
import pandasql as pdsql

In [ ]:
hyp.head(3)

In [ ]:
str1= "select Read, Math1 from hyp where Read<30 or Math1 >60 ;"

In [ ]:
df1 = pdsql.sqldf(str1)

In [ ]:
df1.head(3)

---

In [ ]:
### How to use the string functions on a character columns

In [ ]:
matches.head(3)

In [ ]:
matches.player_of_match.iloc[0].split()

In [ ]:
matches.player_of_match.str.split()[:3] #then this string fn will be automatically applied to each row in this series

In [ ]:
matches.fname = matches.player_of_match.str.split().str[0]

In [ ]:
matches.fname[:3]

In [ ]:
matches.fname = matches.player_of_match.str.split().str.get(0)

In [ ]:
matches.fname[:4]

In [ ]:
#Suppose you want to convert the toss decision to upper case
matches.toss_decision = matches.toss_decision.str.upper()

In [ ]:
#how do i loop over the rows of the dataframe
len(brics) #corresponding to 7 rows

In [ ]:
#to iterate over each row of the df
for row in range(len(brics)):
    print(brics.iloc[row],"\n")

In [ ]:
for lab, row in brics.iterrows():
    print(lab)
    print()
    print(row['AREA'])
    print()
    print()

In [ ]:
#can be used to iterate over the columns
i in brics:
    print(i)

In [ ]:
matches['toss_d'] = 'a'

In [ ]:
matches.head(3)

In [ ]:
matches.toss_decision[0]= matches.toss_decision[0].upper()

In [ ]:
matches.toss_decision[0]

In [ ]:
matches.toss_decision.dtype

In [ ]:
matches["toss_d"].dtype

In [ ]:
matches['toss_d'][0] = matches.toss_decision[0].upper()

In [ ]:
for i in range(len(matches[:5])):
    matches['toss_d'][i] = matches.toss_decision[i].upper()

In [ ]:
matches["toss_d"][:4]

In [ ]:
matches["match_opponents"] = matches['team1'] + " vs "+ matches['team2']

In [ ]:
### Apply function - to apply some function on each component of the series

In [ ]:
brics.COUNTRY[:4]

In [ ]:
brics["length_country"] = brics.COUNTRY.apply(len)

In [ ]:
brics

In [ ]:
s = pd.Series([20,21,12], index = ['London', "New York", "California"])

In [ ]:
s

In [ ]:
s.apply(np.log)

In [ ]:
def add_custom_values(x, *args, **kwargs):
    for month in kwargs:
        x+=kwargs[month]
    return x

a = s.apply(add_custom_values, june = 30, july = 31, aug = 25, sept = 100)
pd.DataFrame(data = [s,a])

In [ ]:
#to remove the duplicate rows
matches  = matches.drop_duplicates()

In [ ]:
set('america') #unordered

----

In [ ]:
#to delete rows axis = 0 and to delete cols axis = 1

In [ ]:
matches.drop([0,1], axis=0 )[:2] #as a result, row labels 0 and 1 are dropped

In [ ]:
matches.sort_values(by = ['team1',"win_by_runs"], ascending=True)

In [ ]:
matches.to_csv("file.csv")

---

In [ ]:
#Regular expressions to clean the strings

In [ ]:
data = {'raw': ['Arizona 1 2014-12-23       3242.0',
                'Iowa 1 2010-02-23       3453.7',
                'Oregon 0 2014-06-20       2123.0',
                'Maryland 0 2014-03-14       1123.6',
                'Florida 1 2013-01-15       2134.0',
                'Georgia 0 2012-07-14       2345.6']}
df = pd.DataFrame(data, columns = ['raw'])
df

In [ ]:
a = df.iloc[0][0]
a

In [ ]:
import re
re.search("(\d)", a)

In [ ]:
#to extract single digit in the strings
df['female'] = df['raw'].str.extract("(\d)", expand=True)
df

In [ ]:
df['date'] = df['raw'].str.extract('(....-..-..)', expand= True)

In [ ]:
df

In [ ]:
df['score'] = df['raw'].str.extract('(\d\d\d\d\.\d)', expand = True)

In [ ]:
df

In [ ]:
df['state'] = df['raw'].str.extract('([A-Z]\w{1,})', expand = True)
df